una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam7x128.h
/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91SAM7X128*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PA0_RXD0     ((unsigned int) AT91C_PIO_PA0) /*  USART 0 Receive Data*/
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PA1_TXD0     ((unsigned int) AT91C_PIO_PA1) /*  USART 0 Transmit Data*/
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PA10_TWD      ((unsigned int) AT91C_PIO_PA10) /*  TWI Two-wire Serial Data*/
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PA11_TWCK     ((unsigned int) AT91C_PIO_PA11) /*  TWI Two-wire Serial Clock*/
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PA12_SPI0_NPCS0 ((unsigned int) AT91C_PIO_PA12) /*  SPI 0 Peripheral Chip Select 0*/
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PA13_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA13) /*  SPI 0 Peripheral Chip Select 1*/
#define AT91C_PA13_PCK1     ((unsigned int) AT91C_PIO_PA13) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PA14_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA14) /*  SPI 0 Peripheral Chip Select 2*/
#define AT91C_PA14_IRQ1     ((unsigned int) AT91C_PIO_PA14) /*  External Interrupt 1*/
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PA15_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA15) /*  SPI 0 Peripheral Chip Select 3*/
#define AT91C_PA15_TCLK2    ((unsigned int) AT91C_PIO_PA15) /*  Timer Counter 2 external clock input*/
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PA16_SPI0_MISO ((unsigned int) AT91C_PIO_PA16) /*  SPI 0 Master In Slave*/
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PA17_SPI0_MOSI ((unsigned int) AT91C_PIO_PA17) /*  SPI 0 Master Out Slave*/
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PA18_SPI0_SPCK ((unsigned int) AT91C_PIO_PA18) /*  SPI 0 Serial Clock*/
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PA19_CANRX    ((unsigned int) AT91C_PIO_PA19) /*  CAN Receive*/
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PA2_SCK0     ((unsigned int) AT91C_PIO_PA2) /*  USART 0 Serial Clock*/
#define AT91C_PA2_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PA2) /*  SPI 1 Peripheral Chip Select 1*/
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PA20_CANTX    ((unsigned int) AT91C_PIO_PA20) /*  CAN Transmit*/
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PA21_TF       ((unsigned int) AT91C_PIO_PA21) /*  SSC Transmit Frame Sync*/
#define AT91C_PA21_SPI1_NPCS0 ((unsigned int) AT91C_PIO_PA21) /*  SPI 1 Peripheral Chip Select 0*/
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PA22_TK       ((unsigned int) AT91C_PIO_PA22) /*  SSC Transmit Clock*/
#define AT91C_PA22_SPI1_SPCK ((unsigned int) AT91C_PIO_PA22) /*  SPI 1 Serial Clock*/
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PA23_TD       ((unsigned int) AT91C_PIO_PA23) /*  SSC Transmit data*/
#define AT91C_PA23_SPI1_MOSI ((unsigned int) AT91C_PIO_PA23) /*  SPI 1 Master Out Slave*/
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PA24_RD       ((unsigned int) AT91C_PIO_PA24) /*  SSC Receive Data*/
#define AT91C_PA24_SPI1_MISO ((unsigned int) AT91C_PIO_PA24) /*  SPI 1 Master In Slave*/
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PA25_RK       ((unsigned int) AT91C_PIO_PA25) /*  SSC Receive Clock*/
#define AT91C_PA25_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PA25) /*  SPI 1 Peripheral Chip Select 1*/
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) /* Pin Controlled by PA26*/
#define AT91C_PA26_RF       ((unsigned int) AT91C_PIO_PA26) /*  SSC Receive Frame Sync*/
#define AT91C_PA26_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PA26) /*  SPI 1 Peripheral Chip Select 2*/
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) /* Pin Controlled by PA27*/
#define AT91C_PA27_DRXD     ((unsigned int) AT91C_PIO_PA27) /*  DBGU Debug Receive Data*/
#define AT91C_PA27_PCK3     ((unsigned int) AT91C_PIO_PA27) /*  PMC Programmable Clock Output 3*/
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) /* Pin Controlled by PA28*/
#define AT91C_PA28_DTXD     ((unsigned int) AT91C_PIO_PA28) /*  DBGU Debug Transmit Data*/
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) /* Pin Controlled by PA29*/
#define AT91C_PA29_FIQ      ((unsigned int) AT91C_PIO_PA29) /*  AIC Fast Interrupt Input*/
#define AT91C_PA29_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PA29) /*  SPI 1 Peripheral Chip Select 3*/
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PA3_RTS0     ((unsigned int) AT91C_PIO_PA3) /*  USART 0 Ready To Send*/
#define AT91C_PA3_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PA3) /*  SPI 1 Peripheral Chip Select 2*/
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) /* Pin Controlled by PA30*/
#define AT91C_PA30_IRQ0     ((unsigned int) AT91C_PIO_PA30) /*  External Interrupt 0*/
#define AT91C_PA30_PCK2     ((unsigned int) AT91C_PIO_PA30) /*  PMC Programmable Clock Output 2*/
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PA4_CTS0     ((unsigned int) AT91C_PIO_PA4) /*  USART 0 Clear To Send*/
#define AT91C_PA4_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PA4) /*  SPI 1 Peripheral Chip Select 3*/
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PA5_RXD1     ((unsigned int) AT91C_PIO_PA5) /*  USART 1 Receive Data*/
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PA6_TXD1     ((unsigned int) AT91C_PIO_PA6) /*  USART 1 Transmit Data*/
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PA7_SCK1     ((unsigned int) AT91C_PIO_PA7) /*  USART 1 Serial Clock*/
#define AT91C_PA7_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA7) /*  SPI 0 Peripheral Chip Select 1*/
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PA8_RTS1     ((unsigned int) AT91C_PIO_PA8) /*  USART 1 Ready To Send*/
#define AT91C_PA8_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA8) /*  SPI 0 Peripheral Chip Select 2*/
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PA9_CTS1     ((unsigned int) AT91C_PIO_PA9) /*  USART 1 Clear To Send*/
#define AT91C_PA9_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA9) /*  SPI 0 Peripheral Chip Select 3*/
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) /* Pin Controlled by PB0*/
#define AT91C_PB0_ETXCK_EREFCK ((unsigned int) AT91C_PIO_PB0) /*  Ethernet MAC Transmit Clock/Reference Clock*/
#define AT91C_PB0_PCK0     ((unsigned int) AT91C_PIO_PB0) /*  PMC Programmable Clock Output 0*/
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) /* Pin Controlled by PB1*/
#define AT91C_PB1_ETXEN    ((unsigned int) AT91C_PIO_PB1) /*  Ethernet MAC Transmit Enable*/
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) /* Pin Controlled by PB10*/
#define AT91C_PB10_ETX2     ((unsigned int) AT91C_PIO_PB10) /*  Ethernet MAC Transmit Data 2*/
#define AT91C_PB10_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PB10) /*  SPI 1 Peripheral Chip Select 1*/
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) /* Pin Controlled by PB11*/
#define AT91C_PB11_ETX3     ((unsigned int) AT91C_PIO_PB11) /*  Ethernet MAC Transmit Data 3*/
#define AT91C_PB11_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PB11) /*  SPI 1 Peripheral Chip Select 2*/
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) /* Pin Controlled by PB12*/
#define AT91C_PB12_ETXER    ((unsigned int) AT91C_PIO_PB12) /*  Ethernet MAC Transmikt Coding Error*/
#define AT91C_PB12_TCLK0    ((unsigned int) AT91C_PIO_PB12) /*  Timer Counter 0 external clock input*/
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) /* Pin Controlled by PB13*/
#define AT91C_PB13_ERX2     ((unsigned int) AT91C_PIO_PB13) /*  Ethernet MAC Receive Data 2*/
#define AT91C_PB13_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PB13) /*  SPI 0 Peripheral Chip Select 1*/
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) /* Pin Controlled by PB14*/
#define AT91C_PB14_ERX3     ((unsigned int) AT91C_PIO_PB14) /*  Ethernet MAC Receive Data 3*/
#define AT91C_PB14_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PB14) /*  SPI 0 Peripheral Chip Select 2*/
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) /* Pin Controlled by PB15*/
#define AT91C_PB15_ERXDV_ECRSDV ((unsigned int) AT91C_PIO_PB15) /*  Ethernet MAC Receive Data Valid*/
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) /* Pin Controlled by PB16*/
#define AT91C_PB16_ECOL     ((unsigned int) AT91C_PIO_PB16) /*  Ethernet MAC Collision Detected*/
#define AT91C_PB16_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PB16) /*  SPI 1 Peripheral Chip Select 3*/
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) /* Pin Controlled by PB17*/
#define AT91C_PB17_ERXCK    ((unsigned int) AT91C_PIO_PB17) /*  Ethernet MAC Receive Clock*/
#define AT91C_PB17_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PB17) /*  SPI 0 Peripheral Chip Select 3*/
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) /* Pin Controlled by PB18*/
#define AT91C_PB18_EF100    ((unsigned int) AT91C_PIO_PB18) /*  Ethernet MAC Force 100 Mbits/sec*/
#define AT91C_PB18_ADTRG    ((unsigned int) AT91C_PIO_PB18) /*  ADC External Trigger*/
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) /* Pin Controlled by PB19*/
#define AT91C_PB19_PWM0     ((unsigned int) AT91C_PIO_PB19) /*  PWM Channel 0*/
#define AT91C_PB19_TCLK1    ((unsigned int) AT91C_PIO_PB19) /*  Timer Counter 1 external clock input*/
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) /* Pin Controlled by PB2*/
#define AT91C_PB2_ETX0     ((unsigned int) AT91C_PIO_PB2) /*  Ethernet MAC Transmit Data 0*/
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) /* Pin Controlled by PB20*/
#define AT91C_PB20_PWM1     ((unsigned int) AT91C_PIO_PB20) /*  PWM Channel 1*/
#define AT91C_PB20_PCK0     ((unsigned int) AT91C_PIO_PB20) /*  PMC Programmable Clock Output 0*/
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) /* Pin Controlled by PB21*/
#define AT91C_PB21_PWM2     ((unsigned int) AT91C_PIO_PB21) /*  PWM Channel 2*/
#define AT91C_PB21_PCK1     ((unsigned int) AT91C_PIO_PB21) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) /* Pin Controlled by PB22*/
#define AT91C_PB22_PWM3     ((unsigned int) AT91C_PIO_PB22) /*  PWM Channel 3*/
#define AT91C_PB22_PCK2     ((unsigned int) AT91C_PIO_PB22) /*  PMC Programmable Clock Output 2*/
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) /* Pin Controlled by PB23*/
#define AT91C_PB23_TIOA0    ((unsigned int) AT91C_PIO_PB23) /*  Timer Counter 0 Multipurpose Timer I/O Pin A*/
#define AT91C_PB23_DCD1     ((unsigned int) AT91C_PIO_PB23) /*  USART 1 Data Carrier Detect*/
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) /* Pin Controlled by PB24*/
#define AT91C_PB24_TIOB0    ((unsigned int) AT91C_PIO_PB24) /*  Timer Counter 0 Multipurpose Timer I/O Pin B*/
#define AT91C_PB24_DSR1     ((unsigned int) AT91C_PIO_PB24) /*  USART 1 Data Set ready*/
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) /* Pin Controlled by PB25*/
#define AT91C_PB25_TIOA1    ((unsigned int) AT91C_PIO_PB25) /*  Timer Counter 1 Multipurpose Timer I/O Pin A*/
#define AT91C_PB25_DTR1     ((unsigned int) AT91C_PIO_PB25) /*  USART 1 Data Terminal ready*/
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) /* Pin Controlled by PB26*/
#define AT91C_PB26_TIOB1    ((unsigned int) AT91C_PIO_PB26) /*  Timer Counter 1 Multipurpose Timer I/O Pin B*/
#define AT91C_PB26_RI1      ((unsigned int) AT91C_PIO_PB26) /*  USART 1 Ring Indicator*/
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) /* Pin Controlled by PB27*/
#define AT91C_PB27_TIOA2    ((unsigned int) AT91C_PIO_PB27) /*  Timer Counter 2 Multipurpose Timer I/O Pin A*/
#define AT91C_PB27_PWM0     ((unsigned int) AT91C_PIO_PB27) /*  PWM Channel 0*/
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) /* Pin Controlled by PB28*/
#define AT91C_PB28_TIOB2    ((unsigned int) AT91C_PIO_PB28) /*  Timer Counter 2 Multipurpose Timer I/O Pin B*/
#define AT91C_PB28_PWM1     ((unsigned int) AT91C_PIO_PB28) /*  PWM Channel 1*/
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) /* Pin Controlled by PB29*/
#define AT91C_PB29_PCK1     ((unsigned int) AT91C_PIO_PB29) /*  PMC Programmable Clock Output 1*/
#define AT91C_PB29_PWM2     ((unsigned int) AT91C_PIO_PB29) /*  PWM Channel 2*/
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) /* Pin Controlled by PB3*/
#define AT91C_PB3_ETX1     ((unsigned int) AT91C_PIO_PB3) /*  Ethernet MAC Transmit Data 1*/
#define AT91C_PIO_PB30       ((unsigned int) 1 << 30) /* Pin Controlled by PB30*/
#define AT91C_PB30_PCK2     ((unsigned int) AT91C_PIO_PB30) /*  PMC Programmable Clock Output 2*/
#define AT91C_PB30_PWM3     ((unsigned int) AT91C_PIO_PB30) /*  PWM Channel 3*/
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) /* Pin Controlled by PB4*/
#define AT91C_PB4_ECRS     ((unsigned int) AT91C_PIO_PB4) /*  Ethernet MAC Carrier Sense/Carrier Sense and Data Valid*/
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) /* Pin Controlled by PB5*/
#define AT91C_PB5_ERX0     ((unsigned int) AT91C_PIO_PB5) /*  Ethernet MAC Receive Data 0*/
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) /* Pin Controlled by PB6*/
#define AT91C_PB6_ERX1     ((unsigned int) AT91C_PIO_PB6) /*  Ethernet MAC Receive Data 1*/
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) /* Pin Controlled by PB7*/
#define AT91C_PB7_ERXER    ((unsigned int) AT91C_PIO_PB7) /*  Ethernet MAC Receive Error*/
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) /* Pin Controlled by PB8*/
#define AT91C_PB8_EMDC     ((unsigned int) AT91C_PIO_PB8) /*  Ethernet MAC Management Data Clock*/
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) /* Pin Controlled by PB9*/
#define AT91C_PB9_EMDIO    ((unsigned int) AT91C_PIO_PB9) /*  Ethernet MAC Management Data Input/Output*/

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM7X128*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Peripheral*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A*/
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_SPI0   ((unsigned int)  4) /* Serial Peripheral Interface 0*/
#define AT91C_ID_SPI1   ((unsigned int)  5) /* Serial Peripheral Interface 1*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_SSC    ((unsigned int)  8) /* Serial Synchronous Controller*/
#define AT91C_ID_TWI    ((unsigned int)  9) /* Two-Wire Interface*/
#define AT91C_ID_PWMC   ((unsigned int) 10) /* PWM Controller*/
#define AT91C_ID_UDP    ((unsigned int) 11) /* USB Device Port*/
#define AT91C_ID_TC0    ((unsigned int) 12) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 13) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 14) /* Timer Counter 2*/
#define AT91C_ID_CAN    ((unsigned int) 15) /* Control Area Network Controller*/
#define AT91C_ID_EMAC   ((unsigned int) 16) /* Ethernet MAC*/
#define AT91C_ID_ADC    ((unsigned int) 17) /* Analog-to-Digital Converter*/
#define AT91C_ID_18_Reserved ((unsigned int) 18) /* Reserved*/
#define AT91C_ID_19_Reserved ((unsigned int) 19) /* Reserved*/
#define AT91C_ID_20_Reserved ((unsigned int) 20) /* Reserved*/
#define AT91C_ID_21_Reserved ((unsigned int) 21) /* Reserved*/
#define AT91C_ID_22_Reserved ((unsigned int) 22) /* Reserved*/
#define AT91C_ID_23_Reserved ((unsigned int) 23) /* Reserved*/
#define AT91C_ID_24_Reserved ((unsigned int) 24) /* Reserved*/
#define AT91C_ID_25_Reserved ((unsigned int) 25) /* Reserved*/
#define AT91C_ID_26_Reserved ((unsigned int) 26) /* Reserved*/
#define AT91C_ID_27_Reserved ((unsigned int) 27) /* Reserved*/
#define AT91C_ID_28_Reserved ((unsigned int) 28) /* Reserved*/
#define AT91C_ID_29_Reserved ((unsigned int) 29) /* Reserved*/
#define AT91C_ID_IRQ0   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ALL_INT   ((unsigned int) 0xC003FFFF) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91SAM7X128*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFF000) /* (SYS) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) /* (DBGU) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOA) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOB) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) /* (CKGR) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_VREG      ((AT91PS_VREG) 	0xFFFFFD60) /* (VREG) Base Address*/
#define AT91C_BASE_MC        ((AT91PS_MC) 	0xFFFFFF00) /* (MC) Base Address*/
#define AT91C_BASE_PDC_SPI1  ((AT91PS_PDC) 	0xFFFE4100) /* (PDC_SPI1) Base Address*/
#define AT91C_BASE_SPI1      ((AT91PS_SPI) 	0xFFFE4000) /* (SPI1) Base Address*/
#define AT91C_BASE_PDC_SPI0  ((AT91PS_PDC) 	0xFFFE0100) /* (PDC_SPI0) Base Address*/
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0xFFFE0000) /* (SPI0) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFC4100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFC4000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFC0100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFC0000) /* (US0) Base Address*/
#define AT91C_BASE_PDC_SSC   ((AT91PS_PDC) 	0xFFFD4100) /* (PDC_SSC) Base Address*/
#define AT91C_BASE_SSC       ((AT91PS_SSC) 	0xFFFD4000) /* (SSC) Base Address*/
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFFB8000) /* (TWI) Base Address*/
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFCC260) /* (PWMC_CH3) Base Address*/
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFCC240) /* (PWMC_CH2) Base Address*/
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFCC220) /* (PWMC_CH1) Base Address*/
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFCC200) /* (PWMC_CH0) Base Address*/
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFCC000) /* (PWMC) Base Address*/
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFFB0000) /* (UDP) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) /* (TC2) Base Address*/
#define AT91C_BASE_TCB       ((AT91PS_TCB) 	0xFFFA0000) /* (TCB) Base Address*/
#define AT91C_BASE_CAN_MB0   ((AT91PS_CAN_MB) 	0xFFFD0200) /* (CAN_MB0) Base Address*/
#define AT91C_BASE_CAN_MB1   ((AT91PS_CAN_MB) 	0xFFFD0220) /* (CAN_MB1) Base Address*/
#define AT91C_BASE_CAN_MB2   ((AT91PS_CAN_MB) 	0xFFFD0240) /* (CAN_MB2) Base Address*/
#define AT91C_BASE_CAN_MB3   ((AT91PS_CAN_MB) 	0xFFFD0260) /* (CAN_MB3) Base Address*/
#define AT91C_BASE_CAN_MB4   ((AT91PS_CAN_MB) 	0xFFFD0280) /* (CAN_MB4) Base Address*/
#define AT91C_BASE_CAN_MB5   ((AT91PS_CAN_MB) 	0xFFFD02A0) /* (CAN_MB5) Base Address*/
#define AT91C_BASE_CAN_MB6   ((AT91PS_CAN_MB) 	0xFFFD02C0) /* (CAN_MB6) Base Address*/
#define AT91C_BASE_CAN_MB7   ((AT91PS_CAN_MB) 	0xFFFD02E0) /* (CAN_MB7) Base Address*/
#define AT91C_BASE_CAN       ((AT91PS_CAN) 	0xFFFD0000) /* (CAN) Base Address*/
#define AT91C_BASE_EMAC      ((AT91PS_EMAC) 	0xFFFDC000) /* (EMAC) Base Address*/
#define AT91C_BASE_PDC_ADC   ((AT91PS_PDC) 	0xFFFD8100) /* (PDC_ADC) Base Address*/
#define AT91C_BASE_ADC       ((AT91PS_ADC) 	0xFFFD8000) /* (ADC) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91SAM7X128*/
/* ******************************************************************************/
/* ISRAM*/
#define AT91C_ISRAM	 ((char *) 	0x00200000) /* Internal SRAM base address*/
#define AT91C_ISRAM_SIZE	 ((unsigned int) 0x00008000) /* Internal SRAM size in byte (32 Kbytes)*/
/* IFLASH*/
#define AT91C_IFLASH	 ((char *) 	0x00100000) /* Internal FLASH base address*/
#define AT91C_IFLASH_SIZE	 ((unsigned int) 0x00020000) /* Internal FLASH size in byte (128 Kbytes)*/
#define AT91C_IFLASH_PAGE_SIZE	 ((unsigned int) 256) /* Internal FLASH Page Size: 256 bytes*/
#define AT91C_IFLASH_LOCK_REGION_SIZE	 ((unsigned int) 16384) /* Internal FLASH Lock Region Size: 16 Kbytes*/
#define AT91C_IFLASH_NB_OF_PAGES	 ((unsigned int) 512) /* Internal FLASH Number of Pages: 512 bytes*/
#define AT91C_IFLASH_NB_OF_LOCK_BITS	 ((unsigned int) 8) /* Internal FLASH Number of Lock Bits: 8 bytes*/
#endif /* __IAR_SYSTEMS_ICC__ */

